Repository: topconsuite/Public_Utils_NET
Catalog: Telluria.Utils.Crud/Resources/Resources.*.resx
Languages: es, pt_br

# ERROR_BAD_REQUEST
source: The request could not be understood by the server due to malformed syntax.
es: El servidor no pudo entender la solicitud debido a una sintaxis incorrecta.
pt_br: A solicitação não pôde ser compreendida pelo servidor devido à sintaxe malformada.

# ERROR_UNAUTHORIZED
source: The request requires user authentication.
es: La solicitud requiere autenticación de usuario.
pt_br: A solicitação requer autenticação do usuário.

# ERROR_PAYMENT_REQUIRED
source: This code has not yet been implemented and is reserved for use in an upcoming specification.
es: Este código aún no se ha implementado y está reservado para su uso en una próxima especificación.
pt_br: Este código ainda não foi implementado e está reservado para uso em uma próxima especificação.

# ERROR_FORBIDDEN
source: The server understood the request, but is refusing to fulfill it.
es: El servidor entendió la solicitud, pero se niega a cumplirla.
pt_br: O servidor entendeu a solicitação, mas se recusa a atendê-la.

# ERROR_NOT_FOUND
source: The server has not found anything matching the request URI.
es: El servidor no ha encontrado nada que coincida con el URI de la solicitud.
pt_br: O servidor não encontrou nada que corresponda ao URI de solicitação.

# ERROR_METHOD_NOT_ALLOWED
source: The method specified in the Request-Line is not allowed for the resource identified by the Request-URI.
es: El método especificado en Request-Line no está permitido para el recurso identificado por Request-URI.
pt_br: O método especificado na Request-Line não é permitido para o recurso identificado pelo Request-URI.

# ERROR_NOT_ACCEPTABLE
source: The resource identified by the request is only capable of generating response entities which have content characteristics acceptable according to the accept headers sent in the request.
es: El recurso identificado por la solicitud solo es capaz de generar entidades de respuesta que tengan características de contenido aceptables de acuerdo con los encabezados de aceptación enviados en la solicitud.
pt_br: O recurso identificado pela solicitação só é capaz de gerar entidades de resposta que tenham características de conteúdo aceitáveis de acordo com os cabeçalhos de aceitação enviados na solicitação.

# ERROR_PROXY_AUTHENTICATION_REQUIRED
source: That the client must first authenticate itself with the proxy.
es: Que el cliente primero debe autenticarse con el proxy.
pt_br: Que o cliente deve primeiro autenticar-se com o proxy.

# ERROR_REQUEST_TIMEOUT
source: The client did not produce a request within the time that the server was prepared to wait.
es: El cliente no produjo una solicitud dentro del tiempo que el servidor estaba preparado para esperar.
pt_br: O cliente não produziu uma solicitação dentro do tempo que o servidor estava preparado para esperar.

# ERROR_CONFLICT
source: The request could not be completed due to a conflict with the current state of the resource.
es: A solicitação não pôde ser concluída devido a um conflito com o estado atual do recurso.
pt_br: A solicitação não pôde ser concluída devido a um conflito com o estado atual do recurso.

# ERROR_GONE
source: The requested resource is no longer available at the server and no forwarding address is known.
es: El recurso solicitado ya no está disponible en el servidor y no se conoce ninguna dirección de reenvío.
pt_br: O recurso solicitado não está mais disponível no servidor e nenhum endereço de encaminhamento é conhecido.

# ERROR_LENGTH_REQUIRED
source: The server refuses to accept the request without a defined content length.
es: El servidor se niega a aceptar la solicitud sin una longitud de contenido definida.
pt_br: O servidor se recusa a aceitar a solicitação sem um comprimento de conteúdo definido.

# ERROR_PRECONDITION_FAILED
source: The precondition given in one or more of the request header fields evaluated to false when it was tested on the server.
es: La condición previa proporcionada en uno o más de los campos del encabezado de la solicitud se evaluó como falso cuando se probó en el servidor.
pt_br: A pré-condição fornecida em um ou mais dos campos de cabeçalho de solicitação avaliados como falso quando foi testado no servidor.

# ERROR_PAYLOAD_TOO_LARGE
source: The server is refusing to process a request because the request payload is larger than the server is willing or able to process.
es: El servidor se niega a procesar una solicitud porque la carga útil de la solicitud es mayor de lo que el servidor está dispuesto o puede procesar.
pt_br: O servidor está se recusando a processar uma solicitação porque a carga útil da solicitação é maior do que o servidor deseja ou pode processar.

# ERROR_URI_TOO_LONG
source: The server is refusing to service the request because the request URI is longer than the server is willing to interpret.
es: El servidor se niega a atender la solicitud porque el URI de la solicitud es más largo de lo que el servidor está dispuesto a interpretar.
pt_br: O servidor está se recusando a atender a solicitação porque o URI da solicitação é maior do que o servidor está disposto a interpretar.

# ERROR_UNSUPPORTED_MEDIA_TYPE
source: The server is refusing to service the request because the entity of the request is in a format not supported by the requested resource for the requested method.
es: El servidor se niega a atender la solicitud porque la entidad de la solicitud está en un formato que no es compatible con el recurso solicitado para el método solicitado.
pt_br: O servidor está se recusando a atender a solicitação porque a entidade da solicitação está em um formato não suportado pelo recurso solicitado para o método solicitado.

# ERROR_RANGE_NOT_SATISFIABLE
source: None of the range-specifier values in a Range request header field overlap the current extent of the selected resource.
es: Ninguno de los valores especificadores de rango en un campo de encabezado de solicitud de rango se superpone a la extensión actual del recurso seleccionado.
pt_br: Nenhum dos valores do especificador de intervalo em um campo de cabeçalho de solicitação de intervalo se sobrepõe à extensão atual do recurso selecionado.

# ERROR_EXPECTATION_FAILED
source: The expectation given in an Expect request header field could not be met by at least one of the inbound servers.
es: La expectativa dada en un campo de encabezado de solicitud Expect no pudo ser satisfecha por al menos uno de los servidores entrantes.
pt_br: A expectativa fornecida em um campo de cabeçalho de solicitação Expect não pôde ser atendida por pelo menos um dos servidores de entrada.

# ERROR_IM_A_TEAPOT
source: The server refuses to brew coffee because it is a teapot.
es: El servidor se niega a preparar café porque es una tetera.
pt_br: O servidor se recusa a preparar café porque é um bule.

# ERROR_MISDIRECTED_REQUEST
source: The request was directed at a server that is not able to produce a response.
es: La solicitud se dirigió a un servidor que no puede producir una respuesta.
pt_br: A solicitação foi direcionada a um servidor que não pode produzir uma resposta.

# ERROR_UNPROCESSABLE_ENTITY
source: The server understands the content type of the request entity and the syntax of the request entity is correct but was unable to process the contained instructions.
es: El servidor comprende el tipo de contenido de la entidad de solicitud y la sintaxis de la entidad de solicitud es correcta, pero no pudo procesar las instrucciones contenidas.
pt_br: O servidor entende o tipo de conteúdo da entidade de solicitação e a sintaxe da entidade de solicitação está correta, mas não conseguiu processar as instruções contidas.

# ERROR_LOCKED
source: The request has been accepted but processing has not been completed.
es: La solicitud ha sido aceptada pero el procesamiento no se ha completado.
pt_br: A solicitação foi aceita, mas o processamento não foi concluído.

# ERROR_FAILED_DEPENDENCY
source: The request failed due to failure of a previous request.
es: La solicitud falló debido a la falla de una solicitud anterior.
pt_br: A solicitação falhou devido à falha de uma solicitação anterior.

# ERROR_UPGRADE_REQUIRED
source: The client must switch to a different protocol such as TLS/1.0.
es: El cliente debe cambiar a un protocolo diferente, como TLS/1.0.
pt_br: O cliente deve alternar para um protocolo diferente, como TLS/1.0.

# ERROR_PRECONDITION_REQUIRED
source: The origin server requires the request to be conditional.
es: El servidor de origen requiere que la solicitud sea condicional.
pt_br: O servidor de origem exige que a solicitação seja condicional.

# ERROR_TOO_MANY_REQUESTS
source: The user has sent too many requests in a given amount of time.
es: El usuario ha enviado demasiadas solicitudes en un período de tiempo determinado.
pt_br: O usuário enviou muitas solicitações em um determinado período de tempo.

# ERROR_REQUEST_HEADER_FIELDS_TOO_LARGE
source: The server is unwilling to process the request because its header fields are too large.
es: El servidor no está dispuesto a procesar la solicitud porque sus campos de encabezado son demasiado grandes.
pt_br: O servidor não está disposto a processar a solicitação porque seus campos de cabeçalho são muito grandes.

# ERROR_CONNECTION_CLOSED_WITHOUT_RESPONSE
source: The server closed the connection without returning a response.
es: El servidor cerró la conexión sin devolver una respuesta.
pt_br: O servidor fechou a conexão sem retornar uma resposta.

# ERROR_UNAVAILABLE_FOR_LEGAL_REASONS
source: The server is denying access to the resource in response to a legal demand.
es: El servidor niega el acceso al recurso en respuesta a una demanda legal.
pt_br: O servidor está negando acesso ao recurso em resposta a uma demanda legal.

# ERROR_INTERNAL_SERVER_ERROR
source: The server encountered an unexpected condition that prevented it from fulfilling the request.
es: El servidor encontró una condición inesperada que le impidió cumplir con la solicitud.
pt_br: O servidor encontrou uma condição inesperada que o impediu de atender à solicitação.

# ERROR_NOT_IMPLEMENTED
source: The server does not support the functionality required to fulfill the request.
es: El servidor no admite la funcionalidad requerida para cumplir con la solicitud.
pt_br: O servidor não oferece suporte à funcionalidade necessária para atender à solicitação.

# ERROR_BAD_GATEWAY
source: The server, while acting as a gateway or proxy, received an invalid response from the upstream server it accessed in attempting to fulfill the request.
es: El servidor, mientras actuaba como puerta de enlace o proxy, recibió una respuesta no válida del servidor ascendente al que accedió al intentar cumplir con la solicitud.
pt_br: O servidor, enquanto atuava como gateway ou proxy, recebeu uma resposta inválida do servidor upstream acessado na tentativa de atender à solicitação.

# ERROR_SERVICE_UNAVAILABLE
source: The server is currently unable to handle the request due to a temporary overloading or maintenance of the server.
es: El servidor actualmente no puede manejar la solicitud debido a una sobrecarga temporal o mantenimiento del servidor.
pt_br: No momento, o servidor não consegue lidar com a solicitação devido a uma sobrecarga temporária ou manutenção do servidor.

# ERROR_GATEWAY_TIMEOUT
source: The server, while acting as a gateway or proxy, did not receive a timely response from the upstream server specified by the URI (e.g. HTTP, FTP, LDAP) or some other auxiliary server (e.g. DNS) it needed to access in attempting to complete the request.
es: El servidor, mientras actuaba como puerta de enlace o proxy, no recibió una respuesta oportuna del servidor ascendente especificado por el URI (p. ej., HTTP, FTP, LDAP) o algún otro servidor auxiliar (p. ej., DNS) al que necesitaba acceder para intentar completar la solicitud.
pt_br: O servidor, enquanto atuava como gateway ou proxy, não recebeu uma resposta oportuna do servidor upstream especificado pelo URI (por exemplo, HTTP, FTP, LDAP) ou algum outro servidor auxiliar (por exemplo, DNS) que precisava acessar na tentativa de concluir o pedido.

# ERROR_HTTP_VERSION_NOT_SUPPORTED
source: The server does not support, or refuses to support, the HTTP protocol version that was used in the request message.
es: El servidor no admite o se niega a admitir la versión del protocolo HTTP que se utilizó en el mensaje de solicitud.
pt_br: O servidor não oferece suporte ou se recusa a oferecer suporte à versão do protocolo HTTP que foi usada na mensagem de solicitação.

# ERROR_VARIANT_ALSO_NEGOTIATES
source: The server has an internal configuration error: the chosen variant resource is configured to engage in transparent content negotiation itself, and is therefore not a proper end point in the negotiation process.
es: El servidor tiene un error de configuración interno: el recurso de variante elegido está configurado para participar en la negociación de contenido transparente y, por lo tanto, no es un punto final adecuado en el proceso de negociación.
pt_br: O servidor tem um erro de configuração interno: o recurso de variante escolhido está configurado para se envolver em negociação de conteúdo transparente e, portanto, não é um ponto final adequado no processo de negociação.

# ERROR_INSUFFICIENT_STORAGE
source: The server is unable to store the representation needed to complete the request.
es: El servidor no puede almacenar la representación necesaria para completar la solicitud.
pt_br: O servidor não pode armazenar a representação necessária para concluir a solicitação.

# ERROR_LOOP_DETECTED
source: The server detected an infinite loop while processing the request.
es: El servidor detectó un bucle infinito mientras procesaba la solicitud.
pt_br: O servidor detectou um loop infinito durante o processamento da solicitação.

# ERROR_BANDWIDTH_LIMIT_EXCEEDED
source: The server has exceeded the bandwidth specified by the server administrator; this is often used by shared hosting providers to limit the bandwidth of customers.
es: El servidor ha excedido el ancho de banda especificado por el administrador del servidor; los proveedores de alojamiento compartido suelen utilizar esto para limitar el ancho de banda de los clientes.
pt_br: O servidor excedeu a largura de banda especificada pelo administrador do servidor; isso é frequentemente usado por provedores de hospedagem compartilhada para limitar a largura de banda dos clientes.

# ERROR_NOT_EXTENDED
source: The server does not support, or refuses to support, the protocol version that was used in the request message.
es: El servidor no admite o se niega a admitir la versión del protocolo que se utilizó en el mensaje de solicitud.
pt_br: O servidor não suporta, ou se recusa a suportar, a versão do protocolo que foi usada na mensagem de solicitação.

# ERROR_NETWORK_AUTHENTICATION_REQUIRED
source: The client needs to authenticate to gain network access.
es: El cliente necesita autenticarse para obtener acceso a la red.
pt_br: O cliente precisa se autenticar para obter acesso à rede.

# ERROR_NETWORK_READ_TIMEOUT
source: The server timed out waiting for the network connection.
es: El servidor agotó el tiempo de espera de la conexión de red.
pt_br: O servidor atingiu o tempo limite aguardando a conexão de rede.

# ERROR_NETWORK_CONNECT_TIMEOUT
source: The server timed out while waiting for a proxy connection.
es: Se agotó el tiempo de espera del servidor mientras esperaba una conexión proxy.
pt_br: O servidor atingiu o tempo limite enquanto aguardava uma conexão de proxy.

# ERROR_NOT_TRANSLATED_YET
source: This message is not translated yet.
es: Este mensaje aún no está traducido.
pt_br: Esta mensagem ainda não foi traduzida.

# ERROR_UNKNOWN
source: Unknown error.
es: Error desconocido.
pt_br: Erro desconhecido.
